## Koşullu Eleman İşlemleri

In [2]:
import numpy as np
import pandas as pd

In [3]:
m = np.random.randint(1,30, size=(10,3))
df =pd.DataFrame(m, columns= ["var1","var2","var3"])
df

   var1  var2  var3
0     8    22     8
1    11    23    29
2    26    14    14
3    28     4     1
4    27     9    23
5     4    16    12
6    27    24     7
7    13     1     7
8     9    19    10
9    12    28     3

In [4]:
df["var1"]

0     8
1    11
2    26
3    28
4    27
5     4
6    27
7    13
8     9
9    12
Name: var1, dtype: int32

In [6]:
df[["var1","var2"]][0:2]

   var1  var2
0     8    22
1    11    23

In [7]:
df

   var1  var2  var3
0     8    22     8
1    11    23    29
2    26    14    14
3    28     4     1
4    27     9    23
5     4    16    12
6    27    24     7
7    13     1     7
8     9    19    10
9    12    28     3

In [14]:
df[df.var1 > 15] #var1 değişkeninde 15'ten büyük olan indeksler

   var1  var2  var3
2    26    14    14
3    28     4     1
4    27     9    23
6    27    24     7

In [15]:
df[(df.var1>15) & (df.var3<5)]

   var1  var2  var3
3    28     4     1

In [16]:
df.loc[(df.var1>15), ["var1","var2"]]

   var1  var2
2    26    14
3    28     4
4    27     9
6    27    24

In [18]:
df[(df.var1>15)] [["var1","var2"]]

   var1  var2
2    26    14
3    28     4
4    27     9
6    27    24